{
  "base_url": "https://raw.githubusercontent.com/ikusa-cybersecurity/netsamurai-lists/main/",
  "updated": "2025-06-02T13:24:43Z",
  "expires": "2025-06-07T13:24:43Z",
  "lists": [
    {
      "name": "netsamurai-offsets",
      "desc": {
        "en": "Primary NetSamurai list that indicates the specific fragments of code to be removed in real time to avoid tracking and fingerprinting.",
        "es": "Lista principal de NetSamurai que indica los fragmentos de código específicos que deben eliminarse en tiempo real para evitar el seguimiento y la toma de huellas digitales.",
        "ca": "Llista principal de NetSamurai que indica els fragments de codi específics que s'han d'eliminar en temps real per evitar el seguiment i la presa d'empremtes digitals."
      },
      "path": "offsets/offsets.json",
      "format": "custom",
      "enabled_default": true,
      "hash": "14c0b685efc86fb20d7c21f282f9c1018ef9a0671086097daf2df7b574042324"
    },
    {
      "name": "netsamurai-paywalls",
      "desc": {
        "en": "Supplementary NetSamurai list that removes paywalls for some of the most widely used domains in the region.",
        "es": "Lista suplementaria de NetSamurai que elimina los muros de pago para algunos de los dominios más utilizados en la región.",
        "ca": "Llista suplementària de NetSamurai que elimina els murs de pagament per a alguns dels dominis més utilitzats a la regió."
      },
      "path": "rules/paywalls.json",
      "format": "custom+regex",
      "enabled_default": true,
      "hash": "b2570c2efec22b33bc7c73ccb58128cad7851d9c89a28cf52d6bf5b1305608ba"
    },
    {
      "name": "netsamurai-unbreak",
      "desc": {
        "en": "Supplementary NetSamurai list that indicates cases in which the resources must not be modified, to avoid breaking functionality. To be removed in newer versions.",
        "es": "Lista suplementaria de NetSamurai que indica los casos en los que los recursos no deben modificarse para evitar romper la funcionalidad. Se eliminará en versiones posteriores.",
        "ca": "Llista suplementària de NetSamurai que indica els casos en què els recursos no s'han de modificar per evitar trencar la funcionalitat. S'eliminarà en versions posteriors."
      },
      "path": "rules/unbreak.json",
      "format": "custom+regex",
      "enabled_default": true,
      "hash": "4af9ca9215de8e7d1472abc9dae76575953184221dc001afe1e7597bdc502534"
    },
    {
      "name": "easylist",
      "desc": {
        "en": "Primary filter list that removes most adverts from international webpages, including unwanted frames, images and objects. The EasyList authors: https://easylist.to/.",
        "es": "Lista de filtros principal que elimina la mayoría de los anuncios de las páginas web internacionales, incluyendo marcos, imágenes y objetos no deseados. Los autores de EasyList: https://easylist.to/.",
        "ca": "Llista de filtres principal que elimina la majoria dels anuncis de les pàgines web internacionals, incloent-hi marcs, imatges i objectes no desitjats. Els autors d'EasyList https://easylist.to/."
      },
      "path": "adblock/easylist.txt",
      "format": "adblockplus",
      "enabled_default": true,
      "hash": "508d8b97a30bf94199984ad1d6c1868879f2e5880d2dd6a0e936a60028a88dfb"
    },
    {
      "name": "easyprivacy",
      "desc": {
        "en": "Optional supplementary filter list that completely removes all forms of tracking from the internet, including web bugs, tracking scripts and information collectors. The EasyList authors: https://easylist.to/.",
        "es": "Lista de filtros suplementaria opcional que elimina por completo todas las formas de seguimiento de internet, incluyendo web bugs, scripts de seguimiento y recolectores de información. Los autores de EasyList: https://easylist.to/.",
        "ca": "Llista de filtres suplementària opcional que elimina completament totes les formes de seguiment d'internet, incloent-hi web bugs, scripts de seguiment i recol·lectors d'informació. Els autors d'EasyList: https://easylist.to/."
      },
      "path": "adblock/easyprivacy.txt",
      "format": "adblockplus",
      "enabled_default": false,
      "hash": "b07b37640d9afdb0fdd06a69c64f518bcbf4c6ab6090581aa4e8b0df65887744"
    }
  ]
}
